WingTangWong/Wireless_esp8266_cc110_tool/src/main.cpp
  for(uint32_t i = 0; i < h.pulseCount; ++i) {
    DiskPulse p{};
    if(f.read(reinterpret_cast<uint8_t*>(&p), sizeof(p)) != sizeof(p)) {
      f.close();
      return false;
    }
    pulseDurations[i] = p.durationUs;
    pulseLevels[i] = p.level ? HIGH : LOW;
  }
  f.close();

  pulseCount = (uint16_t)h.pulseCount;
  captureDurationUs = h.durationUs;
  captureDone = true;
  targetFrequencyHz = h.frequencyHz;
  normalizeCapture();

  if(headerOut) *headerOut = h;
  return true;
}

// -----------------------------------------------------------------------------
// Timer1 raw playback
// -----------------------------------------------------------------------------
void IRAM_ATTR rawPlaybackTimerISR() {
  ++txIndex;

  if(txIndex >= txCount) {
    writeGdoFast(LOW);
    timer1_disable();
    txDone = true;
    return;
  }

  uint8_t level = pulseLevels[txIndex];
  if(txInvert) level = !level;
  writeGdoFast(level);

  uint32_t us = pulseDurations[txIndex];
  if(us < 2) us = 2;
  if(us > 1600000UL) us = 1600000UL;
  timer1_write(us * 5U);
}

static void replayCurrent(uint8_t repeats, bool invert) {
  if(!captureDone || pulseCount == 0) return;

  currentMode = "playback";
  configureRawOok(targetBandwidthKhz);
  setRadioFrequency(targetFrequencyHz);

  // During asynchronous TX the MCU drives GDO0 as the serial TX-data input.
  // Put the CC1101's configurable GDO output in high impedance first.
  radio.SpiWriteReg(CC1101_IOCFG0, 0x2E);
  radio.SpiWriteReg(CC1101_IOCFG2, 0x2E);
  pinMode(PIN_CC1101_GDO0, OUTPUT);
  writeGdoFast(LOW);
  radio.SetTx();
  delayMicroseconds(300);

  repeats = constrain(repeats, (uint8_t)1, (uint8_t)10);

  for(uint8_t rep = 0; rep < repeats; ++rep) {
    txIndex = 0;
    txCount = pulseCount;
    txInvert = invert;
    txDone = false;

    uint8_t firstLevel = pulseLevels[0];
    if(txInvert) firstLevel = !firstLevel;
    writeGdoFast(firstLevel);

    timer1_disable();
    timer1_detachInterrupt();
    timer1_isr_init();
    timer1_attachInterrupt(rawPlaybackTimerISR);
    timer1_enable(TIM_DIV16, TIM_EDGE, TIM_SINGLE);

    uint32_t firstUs = pulseDurations[0];
    if(firstUs < 2) firstUs = 2;
    if(firstUs > 1600000UL) firstUs = 1600000UL;
    timer1_write(firstUs * 5U);

    while(!txDone) delay(0);

    timer1_disable();
    timer1_detachInterrupt();
    writeGdoFast(LOW);

    if(rep + 1 < repeats) delay(20);
  }

  radio.setSidle();
  writeGdoFast(LOW);
  pinMode(PIN_CC1101_GDO0, INPUT);
  pinMode(PIN_CC1101_GDO2, INPUT);
  currentMode = "idle";
  restoreTargetRx();
}

// -----------------------------------------------------------------------------
// Gate control: storage + fire
// -----------------------------------------------------------------------------
static bool gateAssignmentValid(const GateAssignment& a) {
  return a.sampleName[0] != '\0' &&
         valid315BandFrequency(a.frequencyHz) &&
         (a.bandwidthKhz == 58 || a.bandwidthKhz == 270 || a.bandwidthKhz == 650) &&
         a.repeats >= 1 && a.repeats <= 10;
}

static bool gateSampleExists(const GateAssignment& a) {
  if(a.sampleName[0] == '\0') return false;
  return LittleFS.exists(samplePath(String(a.sampleName)));
}

static void gateLoadConfig() {
  gateInner = GateAssignment{};
  gateOuter = GateAssignment{};
  gateEnabled = true;

  File f = LittleFS.open(GATE_CONFIG_PATH, "r");
  if(!f) return;

  GateConfigFile c{};
  bool ok = f.read(reinterpret_cast<uint8_t*>(&c), sizeof(c)) == sizeof(c) &&
            memcmp(c.magic, "GATE", 4) == 0 && (c.version == 1 || c.version == 2);
  f.close();
  if(!ok) return;

  gateInner = c.inner;
  gateOuter = c.outer;
  gateEnabled = (c.version >= 2) ? (c.enabled != 0) : true;
}

static bool gateSaveConfig() {
  GateConfigFile c{};
  memcpy(c.magic, "GATE", 4);
  c.version = 2;
  c.enabled = gateEnabled ? 1 : 0;
  c.inner = gateInner;
  c.outer = gateOuter;

  File f = LittleFS.open(GATE_CONFIG_PATH, "w");
  if(!f) return false;
  bool ok = f.write(reinterpret_cast<const uint8_t*>(&c), sizeof(c)) == sizeof(c);
  f.close();
  return ok;
}

// Runs from loop() when the radio is free. Applies the assignment's stored
// frequency/bandwidth, forces maximum TX power, replays, then restores the
// dashboard's RX state and target frequency.
static bool fireGate(const GateAssignment& a) {
  if(!gateAssignmentValid(a)) {
    gateLastFireError = "assignment invalid at fire time";
    return false;
  }

  // Remember the dashboard's radio state before loadSample() overwrites it.
  const uint32_t savedFreq = targetFrequencyHz;
  const uint16_t savedBw = targetBandwidthKhz;
  const int savedPwr = txPowerDbm;

  if(!loadSample(String(a.sampleName))) {   // note: clobbers in-memory capture
    gateLastFireError = "sample '" + String(a.sampleName) + "' missing or unreadable";
    return false;
  }

  targetFrequencyHz = a.frequencyHz;
  targetBandwidthKhz = a.bandwidthKhz;
  txPowerDbm = GATE_TX_POWER_DBM;  // deliberate: mismatched antenna, weak link

  uint8_t repeats = a.repeats;
  if(repeats < GATE_MIN_REPEATS) repeats = GATE_MIN_REPEATS;

  replayCurrent(repeats, a.invert != 0);

  targetFrequencyHz = savedFreq;
  targetBandwidthKhz = savedBw;
  txPowerDbm = savedPwr;
  restoreTargetRx();
  gateLastFireError = "";
  return true;
}

static String gateAssignmentJson(const GateAssignment& a) {
  String s = "{";
  s += "\"assigned\":" + jsonBool(a.sampleName[0] != '\0');
  s += ",\"sampleName\":\"" + jsonEscape(String(a.sampleName)) + "\"";
  s += ",\"sampleExists\":" + jsonBool(gateSampleExists(a));
  s += ",\"frequencyHz\":" + String(a.frequencyHz);
  s += ",\"bandwidthKhz\":" + String(a.bandwidthKhz);
  s += ",\"txPowerDbm\":" + String(a.txPowerDbm);
  s += ",\"repeats\":" + String(a.repeats);
  s += ",\"invert\":" + jsonBool(a.invert != 0);
  s += ",\"ready\":" + jsonBool(gateAssignmentValid(a) && gateSampleExists(a));
  s += "}";
  return s;
}

// -----------------------------------------------------------------------------
// Generic timing clustering / decode helpers
//
// The pure kernels (clustering, encoding classifier, Linear/MegaCode
// recognizers, histogram binning) live in decode.{h,cpp} so they can be
// unit-tested on the host. Everything below is JSON glue over the volatile
// capture buffers.
// -----------------------------------------------------------------------------
static rfd::PulseSpan capturedPulseSpan() {
  return rfd::PulseSpan{
    (const uint32_t*)pulseDurations,
    (const uint8_t*)pulseLevels,
    pulseCount,
  };
}

static String decodeCurrentJson() {
  uint16_t n = pulseCount;
  if(n < 4) return "{\"ok\":false,\"error\":\"not enough pulse data\"}";

