WingTangWong/Wireless_esp8266_cc110_tool/src/main.cpp
  rfd::PulseSpan span = capturedPulseSpan();
  rfd::Clusters all = rfd::kmeans2All(span);
  rfd::Clusters high = rfd::kmeans2Level(span, HIGH);
  rfd::Clusters low = rfd::kmeans2Level(span, LOW);
  if(!all.count) return "{\"ok\":false,\"error\":\"no usable pulse widths\"}";

  float allRatio = all.shortUs > 0 ? all.longUs / all.shortUs : 0;

  rfd::Encoding enc = rfd::classifyEncoding(all, high, low);
  String encoding = rfd::encodingName(enc);

  // ~450 bytes; keep it off the web handler's stack.
  static rfd::BitExtraction be;
  be = rfd::candidateBits(span, all, high, low, enc);
  float syncThreshold = be.syncThresholdUs;

  rfd::MegaParams mp{
    megaPulseUs, megaPulseTolUs, megaSymbolUs, megaSymbolTolUs,
    megaFrameGapUs, megaHeaderLowUs, megaHeaderTolUs,
  };
  rfd::ProtocolDecode linear = rfd::tryLinear(span);
  rfd::ProtocolDecode mega = rfd::tryMegaCode(span, mp);
  rfd::ProtocolDecode ev = rfd::tryEV1527(span, (uint32_t)all.shortUs);
  rfd::ProtocolDecode specific = linear.matched ? linear
                               : mega.matched ? mega
                               : ev;

  String out = "{\"ok\":true";
  out += ",\"frequencyHz\":" + String(targetFrequencyHz);
  out += ",\"pulses\":" + String(n);
  out += ",\"encoding\":\"" + encoding + "\"";
  out += ",\"short_us\":" + String(all.shortUs, 1);
  out += ",\"long_us\":" + String(all.longUs, 1);
  out += ",\"ratio\":" + String(allRatio, 2);
  out += ",\"sync_gap_threshold_us\":" + String(syncThreshold, 0);
  out += ",\"high_clusters_us\":[" + String(high.shortUs, 1) + "," + String(high.longUs, 1) + "]";
  out += ",\"low_clusters_us\":[" + String(low.shortUs, 1) + "," + String(low.longUs, 1) + "]";
  out += ",\"candidate_bits\":\"" + String(be.bits) + "\"";
  out += ",\"candidate_bits_inverted\":\"" + String(be.inverted) + "\"";

  if(specific.matched) {
    out += ",\"protocol_candidate\":\"" + String(specific.name) + "\"";
    out += ",\"protocol_bits\":\"" + String(specific.bits) + "\"";
    out += ",\"protocol_data_dec\":" + String(specific.data);
    out += ",\"protocol_details\":\"" + String(specific.details) + "\"";
  } else {
    out += ",\"protocol_candidate\":null";
  }

  out += "}";
  return out;
}

static String pulseHistogramJson() {
  static constexpr uint8_t BINS = 28;
  uint16_t counts[BINS] = {0};
  uint16_t highs[BINS] = {0};
  uint16_t lows[BINS] = {0};

  if(!pulseCount) return "{\"counts\":[],\"high\":[],\"low\":[],\"labels\":[]}";

  uint32_t binW = rfd::histogram(capturedPulseSpan(), BINS, counts, highs, lows);

  String s = "{\"binWidthUs\":" + String(binW) + ",\"counts\":[";
  for(uint8_t i = 0; i < BINS; ++i) {
    if(i) s += ',';
    s += String(counts[i]);
  }
  s += "],\"high\":[";
  for(uint8_t i = 0; i < BINS; ++i) {
    if(i) s += ',';
    s += String(highs[i]);
  }
  s += "],\"low\":[";
  for(uint8_t i = 0; i < BINS; ++i) {
    if(i) s += ',';
    s += String(lows[i]);
  }
  s += "],\"labels\":[";
  for(uint8_t i = 0; i < BINS; ++i) {
    if(i) s += ',';
    s += '"'; s += String(i * binW); s += '"';
  }
  s += "]}";
  return s;
}

// -----------------------------------------------------------------------------
// Spectrum sweep
// -----------------------------------------------------------------------------
static void startSweep(uint32_t startHz, uint32_t stopHz, uint32_t stepHz,
                       uint16_t dwellMs, uint16_t bwKhz) {
  sweepStartHz = startHz;
  sweepStopHz = stopHz;
  sweepStepHz = stepHz;
  sweepCurrentHz = startHz;
  sweepDwellMs = dwellMs;
  sweepBandwidthKhz = bwKhz;
  sweepCount = 0;
  sweepDone = false;
  sweepActive = true;
  currentMode = "sweeping";
  configureAnalyzer(sweepBandwidthKhz);
}

static void serviceSweep() {
  if(!sweepActive) return;

  if(sweepCurrentHz > sweepStopHz || sweepCount >= MAX_SWEEP_POINTS) {
    sweepActive = false;
    sweepDone = true;
    currentMode = "idle";
    restoreTargetRx();
    return;
  }

  setRadioFrequency(sweepCurrentHz);
  radio.SetRx();
  delay(sweepDwellMs);
  int rssi = radio.getRssi();
  radio.setSidle();

  sweepHz[sweepCount] = sweepCurrentHz;
  sweepRssi[sweepCount] = (int16_t)rssi;
  ++sweepCount;

  if(UINT32_MAX - sweepCurrentHz < sweepStepHz) {
    sweepCurrentHz = sweepStopHz + 1;
  } else {
    sweepCurrentHz += sweepStepHz;
  }
}

// -----------------------------------------------------------------------------
// Web UI
// -----------------------------------------------------------------------------
static const char WEB_UI[] PROGMEM = R"HTML(
<!doctype html>
<html>
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>CC1101 318 MHz Multifunction</title>
<style>
:root{font-family:system-ui,-apple-system,Segoe UI,sans-serif;color:#eee;background:#101214}
body{max-width:1180px;margin:auto;padding:16px}
h1{margin-bottom:6px}.sub{color:#9aa0a6;margin-top:0}
.grid{display:grid;grid-template-columns:repeat(auto-fit,minmax(330px,1fr));gap:12px}
.card{background:#191c20;border:1px solid #30343a;border-radius:12px;padding:14px}
.row{display:flex;gap:8px;flex-wrap:wrap;align-items:end;margin:8px 0}
label{font-size:12px;color:#aeb4bc;display:flex;flex-direction:column;gap:4px}
input,select,button{background:#22262b;color:#eee;border:1px solid #454b53;border-radius:8px;padding:8px}
button{cursor:pointer}button:hover{background:#2d3238}.primary{border-color:#6aa8ff}.danger{border-color:#ce6262}
.badge{display:inline-block;padding:4px 8px;border:1px solid #555c65;border-radius:999px}
.big{font-size:26px;font-weight:700}.muted{color:#979da5;font-size:12px}
canvas{width:100%;height:240px;background:#111418;border-radius:8px;border:1px solid #292d32}
pre{white-space:pre-wrap;word-break:break-word;background:#111418;padding:10px;border-radius:8px;max-height:380px;overflow:auto}
table{width:100%;border-collapse:collapse;font-size:13px}td,th{padding:7px;border-bottom:1px solid #30343a;text-align:left}
.tiny{font-size:11px;padding:5px 7px}.check{flex-direction:row;align-items:center;font-size:13px}
#peaks{font-family:ui-monospace,monospace;font-size:12px;white-space:pre-wrap}
</style>
</head>
<body>
<h1>CC1101 318 MHz Multifunction</h1>
<p class="sub">WeMOS D1 Mini + SmartRC CC1101 3.0.2 &nbsp;·&nbsp; <a href="/gate" style="color:#6aa8ff">Gate control</a></p>
<div class="row"><span id="radio" class="badge">radio…</span><span id="mode" class="badge">idle</span><span id="wifi" class="badge">Wi-Fi…</span><span id="ap" class="badge">AP…</span><span id="heap" class="muted"></span></div>
<div class="row"><button class="tiny" onclick="selftest()">Self-test</button><span id="fwinfo" class="muted"></span><span id="selftest" class="muted"></span></div>

<div class="grid">
<section class="card">
<h2>Target frequency</h2>
<div class="big"><span id="targetText">318.000000</span> MHz</div>
<div class="row">
<label>Frequency MHz<input id="target" type="number" value="318.000000" step="0.001" min="300" max="348"></label>
<label>Capture BW
<select id="bw"><option value="58">58 kHz</option><option value="270">270 kHz</option><option value="650" selected>650 kHz</option></select>
</label>
<button class="primary" onclick="tune()">Tune</button>
</div>
<div class="row">
<button onclick="nudge(-100000)">−100 kHz</button><button onclick="nudge(-20000)">−20 kHz</button><button onclick="nudge(-5000)">−5 kHz</button>
<button onclick="nudge(5000)">+5 kHz</button><button onclick="nudge(20000)">+20 kHz</button><button onclick="nudge(100000)">+100 kHz</button>
</div>
<div class="muted">SPI controls tuning/RSSI/mode. GDO2/D1 captures asynchronous RX data; GDO0/D2 drives asynchronous TX data.</div>
</section>

<section class="card">
<h2>Frequency population / RSSI sweep</h2>
<div class="row">
<label>Start MHz<input id="s0" value="317.700" type="number" step="0.001" min="300" max="348"></label>
<label>Stop MHz<input id="s1" value="318.300" type="number" step="0.001" min="300" max="348"></label>
<label>Step kHz<input id="ss" value="20" type="number" min="5"></label>
<label>Dwell ms<input id="sd" value="3" type="number" min="2" max="25"></label>
<label>RX BW<select id="sbw"><option value="58">58 kHz</option><option value="270">270 kHz</option><option value="650" selected>650 kHz</option></select></label>
</div>
<div class="row"><button class="primary" onclick="sweep()">Sweep</button><button onclick="focusSweep()">Target ±300 kHz</button></div>
<canvas id="spectrum" width="960" height="270"></canvas>
<div id="peaks" class="muted"></div>
<div class="row"><span id="peakinfo" class="muted"></span><button id="tunepeak" class="tiny" style="display:none" onclick="tunePeak()">Tune to peak</button></div>
</section>

<section class="card">
<h2>Raw record</h2>
<div class="row">
<label>Auto-stop ms<input id="recms" value="2500" type="number" min="50" max="10000"></label>
<button class="primary" onclick="recordStart()">Start record</button>
<button onclick="recordStop()">Stop</button>
<button onclick="decodeCurrent()">Decode current</button>
</div>
<div class="row">
<label>Sample name<input id="sampleName" value="sample01" maxlength="24"></label>
<button onclick="saveCurrent()">Save sample</button>
</div>
<div id="recinfo" class="muted">No capture loaded.</div>
<canvas id="pulses" width="960" height="270"></canvas>
</section>

<section class="card">
<h2>Capture / decoder parameters</h2>
<div class="row">
<label>Async data rate kBaud<input id="dataRate" value="38.4" type="number" step="0.1" min="0.02" max="1621.83"></label>
<label>TX power dBm<select id="txPower"><option>-30</option><option>-20</option><option>-15</option><option>-10</option><option>-6</option><option>0</option><option>5</option><option>7</option><option selected>10</option><option>11</option><option>12</option></select></label>
<label>Minimum pulse µs<input id="minPulse" value="40" type="number" min="5" max="2000"></label>
<label>Mega pulse µs<input id="megaPulse" value="1000" type="number" min="100" max="3000"></label>
<label>Pulse tolerance µs<input id="megaPulseTol" value="300" type="number" min="25" max="1500"></label>
<label>Symbol period µs<input id="megaSymbol" value="6000" type="number" min="1000" max="20000"></label>
<label>Symbol tolerance µs<input id="megaSymbolTol" value="1200" type="number" min="100" max="5000"></label>
<label>Frame gap µs<input id="megaFrameGap" value="10000" type="number" min="2000" max="50000"></label>
<label>Header low µs<input id="megaHeaderLow" value="13000" type="number" min="2000" max="50000"></label>
<label>Header tolerance µs<input id="megaHeaderTol" value="3400" type="number" min="100" max="10000"></label>
</div>
<div class="row"><button class="primary" onclick="saveUiSettings(true)">Save browser settings</button><button onclick="resetUiDefaults()">Reset 318 MHz defaults</button><span id="saved" class="muted"></span></div>
<div class="muted">Settings are stored in this browser and restored when the page reopens. Runtime decoder values are pushed back to the ESP8266 automatically.</div>
</section>

<section class="card">
<h2>Decode</h2>
<pre id="decode">No decode yet.</pre>
</section>
</div>

<section class="card">
<h2>Stored samples</h2>
<div class="row">
<label>Playback repeats<input id="repeats" type="number" min="1" max="10" value="1"></label>
<label class="check"><input id="invert" type="checkbox"> Invert playback logic</label>
<button onclick="listSamples()">Refresh</button>
</div>
<table>
<thead><tr><th>Name</th><th>MHz</th><th>Pulses</th><th>Duration</th><th>Actions</th></tr></thead>
<tbody id="samples"></tbody>
</table>
</section>

<script>
const $=id=>document.getElementById(id);
const STORE='cc1101_318_ui_v2';
const SWEEP_STORE='cc1101_318_last_sweep_v2';
const PULSE_STORE='cc1101_318_last_pulse_hist_v2';
const DECODE_STORE='cc1101_318_last_decode_v2';
const RECINFO_STORE='cc1101_318_last_recinfo_v2';
const FIELD_IDS=['target','bw','s0','s1','ss','sd','sbw','recms','sampleName','repeats','invert','dataRate','txPower','minPulse','megaPulse','megaPulseTol','megaSymbol','megaSymbolTol','megaFrameGap','megaHeaderLow','megaHeaderTol'];
let lastSweepDone=false,lastCaptureSignature='',statusTimer=null;

const DEFAULTS={
 target:'318.000000',bw:'650',s0:'317.700',s1:'318.300',ss:'20',sd:'3',sbw:'650',recms:'2500',sampleName:'sample01',repeats:'1',invert:false,
 dataRate:'38.4',txPower:'10',minPulse:'40',megaPulse:'1000',megaPulseTol:'300',megaSymbol:'6000',megaSymbolTol:'1200',megaFrameGap:'10000',megaHeaderLow:'13000',megaHeaderTol:'3400'
};

async function j(url){let r=await fetch(url,{cache:'no-store'});let t=await r.text();let o;try{o=JSON.parse(t)}catch(e){throw Error(t)}if(!r.ok||o.ok===false)throw Error(o.error||t);return o}
function esc(s){return String(s).replace(/[&<>"']/g,m=>({'&':'&amp;','<':'&lt;','>':'&gt;','"':'&quot;',"'":'&#39;'}[m]))}
function err(e){$('decode').textContent='ERROR: '+e.message;localStorage.setItem(DECODE_STORE,$('decode').textContent)}
function num(id,fallback){let raw=String($(id).value??'').trim();if(!raw)return fallback;let v=Number(raw);return Number.isFinite(v)?v:fallback}

