WingTangWong/Wireless_esp8266_cc110_tool/src/main.cpp
function saveUiSettings(showMessage=false){
 let x={};for(let id of FIELD_IDS){let el=$(id);x[id]=el.type==='checkbox'?el.checked:el.value}
 localStorage.setItem(STORE,JSON.stringify(x));
 if(showMessage){$('saved').textContent='Saved';setTimeout(()=>{$('saved').textContent=''},1400)}
 pushRuntimeConfig().catch(()=>{});
}
function loadUiSettings(){
 let x={};try{x=JSON.parse(localStorage.getItem(STORE)||'{}')||{}}catch(e){}
 for(let id of FIELD_IDS){let el=$(id),v=(id in x)?x[id]:DEFAULTS[id];if(v===undefined)continue;if(el.type==='checkbox')el.checked=!!v;else el.value=v}
 let d=localStorage.getItem(DECODE_STORE);if(d)$('decode').textContent=d;
 let ri=localStorage.getItem(RECINFO_STORE);if(ri)$('recinfo').textContent=ri;
 try{let p=JSON.parse(localStorage.getItem(SWEEP_STORE)||'null');if(p&&p.length)drawSpectrum(p)}catch(e){}
 try{let h=JSON.parse(localStorage.getItem(PULSE_STORE)||'null');if(h&&h.counts)drawPulseHistogram(h)}catch(e){}
}
function resetUiDefaults(){for(let id of FIELD_IDS){let el=$(id),v=DEFAULTS[id];if(v===undefined)continue;if(el.type==='checkbox')el.checked=!!v;else el.value=v}saveUiSettings(true)}
async function pushRuntimeConfig(){
 let q=new URLSearchParams({dataRate:num('dataRate',38.4),txPower:Math.round(num('txPower',10)),minPulse:Math.round(num('minPulse',40)),megaPulse:Math.round(num('megaPulse',1000)),megaPulseTol:Math.round(num('megaPulseTol',300)),megaSymbol:Math.round(num('megaSymbol',6000)),megaSymbolTol:Math.round(num('megaSymbolTol',1200)),megaFrameGap:Math.round(num('megaFrameGap',10000)),megaHeaderLow:Math.round(num('megaHeaderLow',13000)),megaHeaderTol:Math.round(num('megaHeaderTol',3400))});
 return j('/api/config?'+q.toString());
}

async function status(){
 try{
  let x=await j('/api/status');
  $('radio').textContent=x.radio?'CC1101 OK':'CC1101 ?';
  $('mode').textContent=x.mode;
  $('wifi').textContent=x.wifiConnected?(x.wifiSsid+' · '+x.wifiIp+' · '+x.wifiRssi+' dBm'):'Wi-Fi reconnecting…';
  $('wifi').title=x.hostname||'';
  $('ap').textContent=x.apActive?('AP '+x.apSsid+' · '+x.apIp+' · '+x.apClients+' client'+(x.apClients==1?'':'s')):'AP down';
  $('heap').textContent='heap '+x.heap+' B';
  if(x.fsTotalBytes){let pct=(100*x.fsUsedBytes/x.fsTotalBytes).toFixed(0);
   $('fwinfo').textContent='fw '+x.firmwareVersion+' ('+x.firmwareBuild+') · CC1101 v'+x.radioVersion+' · FS '+x.fsUsedBytes+'/'+x.fsTotalBytes+' B ('+pct+'%)';}
  // Device status is display-only. Never overwrite editable frequency/sweep fields.
  $('targetText').textContent=(x.frequencyHz/1e6).toFixed(6);
  let sig=x.captureDone+':'+x.pulses+':'+x.captureDurationUs;
  if(x.captureDone&&sig!==lastCaptureSignature){lastCaptureSignature=sig;let ri=x.pulses+' pulses, '+(x.captureDurationUs/1000).toFixed(2)+' ms'+(x.captureTruncated?(' — TRUNCATED at '+x.maxPulses+' pulses, capture cut short'):'');$('recinfo').textContent=ri;localStorage.setItem(RECINFO_STORE,ri);pulseData()}
  if(x.sweepDone&&!lastSweepDone){lastSweepDone=true;spectrumData()}
  if(!x.sweepDone)lastSweepDone=false;
 }catch(e){$('mode').textContent='offline';$('wifi').textContent='Wi-Fi/Web offline'}
}

async function selftest(){
 $('selftest').textContent='running…';
 try{let x=await j('/api/selftest');
  let fails=Object.entries(x.checks).filter(([k,v])=>!v).map(([k])=>k);
  $('selftest').textContent=x.ok?'PASS':'FAIL: '+fails.join(', ');
  $('selftest').style.color=x.ok?'#6ac36a':'#ce6262';
 }catch(e){$('selftest').textContent='error: '+e.message;$('selftest').style.color='#ce6262'}
}

async function tune(){try{saveUiSettings();await pushRuntimeConfig();let hz=Math.round(num('target',318)*1e6),bw=$('bw').value;let x=await j('/api/tune?hz='+hz+'&bw='+bw);$('targetText').textContent=(x.frequencyHz/1e6).toFixed(6)}catch(e){err(e)}}
async function nudge(d){try{let hz=Math.round(num('target',318)*1e6)+d;$('target').value=(hz/1e6).toFixed(6);saveUiSettings();await tune()}catch(e){err(e)}}

async function sweep(){
 try{saveUiSettings();await pushRuntimeConfig();let a=Math.round(num('s0',317.7)*1e6),b=Math.round(num('s1',318.3)*1e6),st=Math.round(num('ss',20)*1e3),d=Math.round(num('sd',3)),bw=$('sbw').value;lastSweepDone=false;await j(`/api/sweep/start?start=${a}&stop=${b}&step=${st}&dwell=${d}&bw=${bw}`)}catch(e){err(e)}
}
async function focusSweep(){let t=Math.round(num('target',318)*1e6);$('s0').value=((t-300000)/1e6).toFixed(3);$('s1').value=((t+300000)/1e6).toFixed(3);$('ss').value=20;$('sd').value=3;$('sbw').value=650;saveUiSettings();await sweep()}
async function spectrumData(){try{let x=await j('/api/sweep/data');drawSpectrum(x.points);localStorage.setItem(SWEEP_STORE,JSON.stringify(x.points))}catch(e){err(e)}}

async function recordStart(){try{saveUiSettings();await pushRuntimeConfig();let hz=Math.round(num('target',318)*1e6),bw=$('bw').value;await j('/api/tune?hz='+hz+'&bw='+bw);lastCaptureSignature='';await j('/api/capture/start?ms='+Math.round(num('recms',2500)))}catch(e){err(e)}}
async function recordStop(){try{await j('/api/capture/stop');status()}catch(e){err(e)}}
async function pulseData(){try{let x=await j('/api/capture/histogram');drawPulseHistogram(x);localStorage.setItem(PULSE_STORE,JSON.stringify(x))}catch(e){err(e)}}
async function decodeCurrent(){try{saveUiSettings();await pushRuntimeConfig();let x=await j('/api/decode/current'),txt=JSON.stringify(x,null,2);$('decode').textContent=txt;localStorage.setItem(DECODE_STORE,txt)}catch(e){err(e)}}
async function saveCurrent(){try{saveUiSettings();await j('/api/sample/save?name='+encodeURIComponent($('sampleName').value));listSamples()}catch(e){err(e)}}

async function listSamples(){
 try{let x=await j('/api/samples'),h='';for(let s of x.samples){let n=encodeURIComponent(s.name);h+=`<tr><td>${esc(s.name)}</td><td>${(s.frequencyHz/1e6).toFixed(6)}</td><td>${s.pulseCount}</td><td>${(s.durationUs/1000).toFixed(1)} ms</td><td><button class="tiny" onclick="sampleLoad('${n}')">Load</button> <button class="tiny" onclick="sampleDecode('${n}')">Decode</button> <button class="tiny" onclick="samplePlay('${n}')">Play</button> <button class="tiny danger" onclick="sampleDelete('${n}')">Delete</button></td></tr>`}$('samples').innerHTML=h||'<tr><td colspan="5" class="muted">No saved samples.</td></tr>'}catch(e){err(e)}
}
async function sampleLoad(n){try{let x=await j('/api/sample/load?name='+n);$('target').value=(x.frequencyHz/1e6).toFixed(6);saveUiSettings();lastCaptureSignature='';await status();await pulseData()}catch(e){err(e)}}
async function sampleDecode(n){try{await pushRuntimeConfig();let x=await j('/api/sample/decode?name='+n),txt=JSON.stringify(x,null,2);$('decode').textContent=txt;localStorage.setItem(DECODE_STORE,txt);lastCaptureSignature='';await status();await pulseData()}catch(e){err(e)}}
async function samplePlay(n){try{saveUiSettings();let r=Math.max(1,Math.min(10,parseInt($('repeats').value)||1)),inv=$('invert').checked?1:0;await j('/api/sample/play?name='+n+'&repeat='+r+'&invert='+inv)}catch(e){err(e)}}
async function sampleDelete(n){try{await j('/api/sample/delete?name='+n);listSamples()}catch(e){err(e)}}

function baseCanvas(id){let c=$(id),g=c.getContext('2d'),w=c.width,h=c.height;g.clearRect(0,0,w,h);g.fillStyle='#111418';g.fillRect(0,0,w,h);g.font='11px sans-serif';return{c,g,w,h}}

function drawSpectrum(points){
 let {g,w,h}=baseCanvas('spectrum');if(!points.length)return;
 let min=-120,max=-20,pad=44,plotH=h-38,plotW=w-pad-8;
 g.strokeStyle='#363b42';g.fillStyle='#aab0b7';
 for(let k=0;k<=5;k++){let y=8+plotH*k/5;g.beginPath();g.moveTo(pad,y);g.lineTo(w-5,y);g.stroke();g.fillText((max-(max-min)*k/5).toFixed(0),4,y+4)}
 let bw=plotW/points.length;
 for(let i=0;i<points.length;i++){let v=Math.max(min,Math.min(max,points[i].rssi)),bh=(v-min)/(max-min)*plotH;g.fillStyle='#6aa8ff';g.fillRect(pad+i*bw,h-22-bh,Math.max(1,bw),bh)}
 let every=Math.max(1,Math.ceil(points.length/8));g.fillStyle='#aab0b7';for(let i=0;i<points.length;i+=every)g.fillText((points[i].hz/1e6).toFixed(3),pad+i*bw,h-5);
 let peaks=[...points].sort((a,b)=>b.rssi-a.rssi).slice(0,8);$('peaks').textContent='Strongest: '+peaks.map(p=>(p.hz/1e6).toFixed(6)+' MHz '+p.rssi+' dBm').join('   |   ');
 if(peaks.length){window._peakHz=peaks[0].hz;let tgt=Math.round(num('target',318)*1e6),off=(peaks[0].hz-tgt)/1e3;
  $('peakinfo').textContent='Peak '+(peaks[0].hz/1e6).toFixed(6)+' MHz ('+(off>=0?'+':'')+off.toFixed(1)+' kHz vs target)';
  $('tunepeak').style.display='';}
}
async function tunePeak(){if(!window._peakHz)return;$('target').value=(window._peakHz/1e6).toFixed(6);saveUiSettings();await tune()}

function drawPulseHistogram(x){
 let {g,w,h}=baseCanvas('pulses');if(!x.counts.length)return;
 let max=Math.max(...x.counts,1),pad=42,plotH=h-40,plotW=w-pad-8,bw=plotW/x.counts.length;
 g.strokeStyle='#363b42';g.fillStyle='#aab0b7';for(let k=0;k<=4;k++){let y=8+plotH*k/4;g.beginPath();g.moveTo(pad,y);g.lineTo(w-5,y);g.stroke();g.fillText(Math.round(max*(1-k/4)),4,y+4)}
 for(let i=0;i<x.counts.length;i++){let total=x.counts[i],hc=x.high[i],lc=x.low[i],bh=total/max*plotH,lh=lc/max*plotH,hh=hc/max*plotH;g.fillStyle='#5c8fd8';g.fillRect(pad+i*bw,h-22-lh,Math.max(1,bw-1),lh);g.fillStyle='#9bc4ff';g.fillRect(pad+i*bw,h-22-lh-hh,Math.max(1,bw-1),hh)}
 let every=Math.max(1,Math.ceil(x.labels.length/8));g.fillStyle='#aab0b7';for(let i=0;i<x.labels.length;i+=every)g.fillText(x.labels[i]+'us',pad+i*bw,h-5)
}


for(let id of FIELD_IDS){$(id).addEventListener('change',()=>saveUiSettings(false))}
loadUiSettings();
pushRuntimeConfig().catch(()=>{});
tune();
status();listSamples();
statusTimer=setInterval(status,900);
</script>
<p class="muted" style="margin-top:24px;border-top:1px solid #30343a;padding-top:10px">
Authorized use only — receive and transmit only on frequencies and equipment you
are permitted to use. RF transmission is regulated and is your responsibility.
</p>
</body>
</html>
)HTML";

