WingTangWong/Wireless_esp8266_cc110_tool/src/main.cpp
// -----------------------------------------------------------------------------
// Gate control operator page (/gate)
// -----------------------------------------------------------------------------
static const char GATE_PAGE[] PROGMEM = R"HTML(
<!doctype html><html><head><meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Gate control</title>
<style>
:root{font-family:system-ui,-apple-system,Segoe UI,sans-serif;color:#eee;background:#101214}
body{max-width:560px;margin:auto;padding:18px}
h1{margin:0 0 2px}.sub{color:#9aa0a6;margin:0 0 16px;font-size:13px}
button.gate{width:100%;font-size:24px;font-weight:700;padding:34px 12px;margin:10px 0;border-radius:16px;background:#1c2733;color:#eee;border:2px solid #3f6b9e;cursor:pointer}
button.gate:active{background:#24445f}
button.gate:disabled{opacity:.45;cursor:not-allowed}
.name{display:block;font-size:13px;font-weight:400;color:#9fb6cf;margin-top:6px}
#toast{min-height:22px;margin-top:8px;font-size:14px}
.warn{color:#e0a94a;font-size:12px;margin-top:18px}
a{color:#6aa8ff;font-size:12px}
</style></head><body>
<h1>Gate control</h1>
<p class="sub">Authorized use only. Operate equipment you own or are permitted to test.</p>
<button class="gate" id="b-inner" onclick="fire('inner')" disabled>Inner gate<span class="name" id="n-inner">loading…</span></button>
<button class="gate" id="b-outer" onclick="fire('outer')" disabled>Outer gate<span class="name" id="n-outer">loading…</span></button>
<div id="toast"></div>
<p class="warn">Each press transmits at maximum power. <a href="/gate/config">Assign samples</a> &nbsp;·&nbsp; <a href="/">Dashboard</a></p>
<script>
const $=i=>document.getElementById(i);
let busy=false;
async function load(){
 try{let r=await fetch('/api/gate',{cache:'no-store'});let g=await r.json();
  for(let w of ['inner','outer']){let a=g[w];
   $('n-'+w).textContent=a.assigned?(a.sampleName+(a.ready?'':' — unavailable')):'unassigned';
   $('b-'+w).disabled=busy||!a.ready||!g.enabled;}
  if(!g.enabled&&!busy)$('toast').textContent='Gate control is disabled (re-enable on the assignment page)';
  else if(g.lastFireError&&!busy)$('toast').textContent='Last fire failed: '+g.lastFireError;
 }catch(e){$('toast').textContent='status error';}
}
async function fire(w){
 if(busy)return;busy=true;$('b-inner').disabled=true;$('b-outer').disabled=true;
 $('toast').textContent='Sending '+w+' gate…';
 try{let r=await fetch('/api/gate/fire?which='+w,{method:'POST'});let o=await r.json();
  $('toast').textContent=o.ok?('Sent '+w+' gate ('+o.sampleName+')'):('Error: '+(o.error||r.status));}
 catch(e){$('toast').textContent='Error: '+e.message;}
 busy=false;load();
}
load();setInterval(load,4000);
</script></body></html>
)HTML";

// -----------------------------------------------------------------------------
// Gate control assignment page (/gate/config)
// -----------------------------------------------------------------------------
static const char GATE_CONFIG_PAGE[] PROGMEM = R"HTML(
<!doctype html><html><head><meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Gate assignment</title>
<style>
:root{font-family:system-ui,-apple-system,Segoe UI,sans-serif;color:#eee;background:#101214}
body{max-width:720px;margin:auto;padding:16px}
h1{margin:0 0 8px}h2{margin:0 0 6px;font-size:16px}
.card{background:#191c20;border:1px solid #30343a;border-radius:12px;padding:14px;margin:12px 0}
label{font-size:12px;color:#aeb4bc;display:flex;flex-direction:column;gap:4px;margin:6px 8px 6px 0}
.row{display:flex;gap:8px;flex-wrap:wrap;align-items:end}
input,select,button{background:#22262b;color:#eee;border:1px solid #454b53;border-radius:8px;padding:8px}
button{cursor:pointer}.primary{border-color:#6aa8ff}
.msg{font-size:12px;color:#9fb6cf;margin-left:6px}
a{color:#6aa8ff;font-size:12px}.muted{color:#8b9199;font-size:12px}
</style></head><body>
<h1>Gate sample assignment</h1>
<p class="muted">Pick which saved recording each gate button replays. On a fire the
device re-applies the frequency/bandwidth set here and transmits at the CC1101's
maximum power (+12 dBm) regardless of any stored power value.</p>
<div class="card"><label style="flex-direction:row;align-items:center;gap:8px">
<input type="checkbox" id="genable"> Gate operator page enabled</label>
<span class="msg" id="gemsg"></span></div>
<div id="cards"></div>
<p><a href="/gate">Gate control</a> &nbsp;·&nbsp; <a href="/">Dashboard</a></p>
<template id="tpl">
<div class="card">
<h2 class="t"></h2>
<div class="row">
<label>Sample<select class="f-sample"></select></label>
<label>Frequency MHz<input class="f-freq" type="number" step="0.001" min="300" max="348"></label>
<label>Bandwidth<select class="f-bw"><option value="58">58 kHz</option><option value="270">270 kHz</option><option value="650">650 kHz</option></select></label>
<label>Repeats<input class="f-rep" type="number" min="1" max="10"></label>
<label style="flex-direction:row;align-items:center;gap:6px"><input class="f-inv" type="checkbox">Invert</label>
</div>
<div class="row">
<button class="primary f-save">Save</button>
<button class="f-test">Save &amp; test fire</button>
<span class="msg f-msg"></span>
</div>
</div>
</template>
<script>
const WHICH=['inner','outer'];
async function j(u,o){let r=await fetch(u,o||{cache:'no-store'});let t=await r.json();if(!r.ok||t.ok===false)throw Error(t.error||r.status);return t;}
async function load(){
 let s=await j('/api/samples');
 let g=await j('/api/gate');
 let byName={};for(let x of s.samples)byName[x.name]=x;
 let ge=document.getElementById('genable');ge.checked=!!g.enabled;
 ge.onchange=async()=>{try{await j('/api/gate/enable?on='+(ge.checked?1:0),{method:'POST'});document.getElementById('gemsg').textContent=ge.checked?'enabled':'disabled';}catch(e){document.getElementById('gemsg').textContent='error: '+e.message;ge.checked=!ge.checked;}};
 let root=document.getElementById('cards');root.innerHTML='';
 for(let w of WHICH){
  let n=document.getElementById('tpl').content.cloneNode(true);
  n.querySelector('.t').textContent=w[0].toUpperCase()+w.slice(1)+' gate';
  let card=n.querySelector('.card');
  let sel=card.querySelector('.f-sample');
  sel.innerHTML='<option value="">- unassigned -</option>'+s.samples.map(x=>`<option>${x.name}</option>`).join('');
  let a=g[w];
  sel.value=a.assigned?a.sampleName:'';
  let freqEl=card.querySelector('.f-freq');
  freqEl.value=((a.frequencyHz||318000000)/1e6).toFixed(3);
  // Picking a sample fills the frequency from that sample's capture.
  sel.onchange=()=>{let x=byName[sel.value];if(x)freqEl.value=(x.frequencyHz/1e6).toFixed(3);};
  card.querySelector('.f-bw').value=a.bandwidthKhz||650;
  card.querySelector('.f-rep').value=a.repeats||4;
  card.querySelector('.f-inv').checked=!!a.invert;
  let body=()=>{let p=new URLSearchParams();p.set('which',w);
   p.set('sampleName',card.querySelector('.f-sample').value);
   p.set('frequencyHz',Math.round(parseFloat(card.querySelector('.f-freq').value||'0')*1e6));
   p.set('bandwidthKhz',card.querySelector('.f-bw').value);
   p.set('repeats',card.querySelector('.f-rep').value);
   p.set('invert',card.querySelector('.f-inv').checked?1:0);return p;};
  let msg=card.querySelector('.f-msg');
  let save=async()=>{msg.textContent='saving…';
   try{await j('/api/gate/assign',{method:'POST',headers:{'Content-Type':'application/x-www-form-urlencoded'},body:body().toString()});msg.textContent='saved';return true;}
   catch(e){msg.textContent='error: '+e.message;return false;}};
  card.querySelector('.f-save').onclick=save;
  card.querySelector('.f-test').onclick=async()=>{if(await save()){msg.textContent='firing…';
   try{let o=await j('/api/gate/fire?which='+w,{method:'POST'});msg.textContent='fired: '+o.sampleName;}
   catch(e){msg.textContent='fire error: '+e.message;}}};
  root.appendChild(n);
 }
}
load().catch(e=>document.getElementById('cards').textContent='Load error: '+e.message);
</script></body></html>
)HTML";

