WingTangWong/Wireless_esp8266_cc110_tool/src/main.cpp
// -----------------------------------------------------------------------------
// Wi-Fi station/client service
// -----------------------------------------------------------------------------
static void startMdnsIfNeeded() {
  if(WiFi.status() != WL_CONNECTED || mdnsStarted) return;
  mdnsStarted = MDNS.begin(WIFI_HOSTNAME);
  if(mdnsStarted) MDNS.addService("http", "tcp", 80);
}

static void startWifiAp() {
  if(!apSsidEffective.length()) {
    // Per-device suffix so two units nearby don't share an SSID.
    apSsidEffective = String(WIFI_AP_SSID) + "-" + String(ESP.getChipId(), HEX);
  }

  WiFi.softAPConfig(WIFI_AP_IP, WIFI_AP_GATEWAY, WIFI_AP_NETMASK);

  const bool open = WIFI_AP_PASS[0] == '\0';
  apActive = WiFi.softAP(apSsidEffective,
                         open ? String() : String(WIFI_AP_PASS),
                         WIFI_AP_CHANNEL,
                         false,                 // not hidden
                         WIFI_AP_MAX_CLIENTS);

  if(apActive) {
    dnsServer.setErrorReplyCode(DNSReplyCode::NoError);
    dnsServer.start(53, "*", WIFI_AP_IP);   // every lookup -> the dashboard
  }
}

static void startWifi() {
  WiFi.persistent(false);
  WiFi.mode(WIFI_AP_STA);
  WiFi.hostname(WIFI_HOSTNAME);
  WiFi.setAutoReconnect(true);

  // Bring the SoftAP up first so the dashboard is reachable even if the home
  // network is out of range or misconfigured.
  startWifiAp();

  WiFi.begin(WIFI_SSID, WIFI_PASS);

  const uint32_t started = millis();
  while(WiFi.status() != WL_CONNECTED &&
        (uint32_t)(millis() - started) < WIFI_CONNECT_TIMEOUT_MS) {
    delay(50);
    yield();
  }

  startMdnsIfNeeded();
}

static void serviceWifi() {
  // Keep the SoftAP alive regardless of station state.
  if(!apActive || (WiFi.getMode() & WIFI_AP) == 0) {
    startWifiAp();
  }
  dnsServer.processNextRequest();

  if(WiFi.status() == WL_CONNECTED) {
    startMdnsIfNeeded();
    if(mdnsStarted) MDNS.update();
    return;
  }

  const uint32_t now = millis();
  if((uint32_t)(now - lastWifiRetryMs) >= WIFI_RETRY_INTERVAL_MS) {
    lastWifiRetryMs = now;
    WiFi.reconnect();
  }
}

// -----------------------------------------------------------------------------
// HTTP routes
// -----------------------------------------------------------------------------
// Reject cross-site POSTs (e.g. a page on another origin trying to fire a gate).
// A same-origin fetch either omits Origin or sends one whose host matches Host;
// native curl/tools omit it too and are allowed.
static bool sameOriginOk() {
  if(!server.hasHeader("Origin")) return true;
  String origin = server.header("Origin");
  String host = server.hostHeader();
  if(!host.length()) return false;
  int ss = origin.indexOf("//");
  String originHost = (ss >= 0) ? origin.substring(ss + 2) : origin;
  return originHost.equalsIgnoreCase(host);
}

static const char* HTTP_COLLECT_HEADERS[] = {"Origin"};

static void setupRoutes() {
  server.collectHeaders(HTTP_COLLECT_HEADERS,
                        sizeof(HTTP_COLLECT_HEADERS) / sizeof(HTTP_COLLECT_HEADERS[0]));

  server.on("/", HTTP_GET, []() {
    server.send_P(200, "text/html", WEB_UI);
  });

  server.on("/gate", HTTP_GET, []() {
    server.send_P(200, "text/html", GATE_PAGE);
  });

  server.on("/gate/config", HTTP_GET, []() {
    server.send_P(200, "text/html", GATE_CONFIG_PAGE);
  });

  server.on("/api/status", HTTP_GET, []() {
    String s = "{\"ok\":true";
    s += ",\"radio\":" + jsonBool(radioOk);
    s += ",\"firmwareVersion\":\"" + String(FIRMWARE_VERSION) + "\"";
    s += ",\"firmwareBuild\":\"" + jsonEscape(String(FIRMWARE_BUILD)) + "\"";
    s += ",\"radioPartnum\":" + String(radioPartnum);
    s += ",\"radioVersion\":" + String(radioVersionReg);
    s += ",\"mode\":\"" + currentMode + "\"";
    s += ",\"wifiConnected\":" + jsonBool(WiFi.status() == WL_CONNECTED);
    s += ",\"wifiSsid\":\"" + jsonEscape(WiFi.status() == WL_CONNECTED ? WiFi.SSID() : String(WIFI_SSID)) + "\"";
    s += ",\"wifiIp\":\"" + (WiFi.status() == WL_CONNECTED ? WiFi.localIP().toString() : String("0.0.0.0")) + "\"";
    s += ",\"wifiRssi\":" + String(WiFi.status() == WL_CONNECTED ? WiFi.RSSI() : 0);
    s += ",\"hostname\":\"" + String(WIFI_HOSTNAME) + ".local\"";
    s += ",\"apActive\":" + jsonBool(apActive);
    s += ",\"apSsid\":\"" + jsonEscape(apSsidEffective) + "\"";
    s += ",\"apIp\":\"" + WiFi.softAPIP().toString() + "\"";
    s += ",\"apClients\":" + String(WiFi.softAPgetStationNum());
    s += ",\"frequencyHz\":" + String(targetFrequencyHz);
    s += ",\"bandwidthKhz\":" + String(targetBandwidthKhz);
    s += ",\"gdo0Pin\":" + String(PIN_CC1101_GDO0);
    s += ",\"gdo2Pin\":" + String(PIN_CC1101_GDO2);
    s += ",\"heap\":" + String(ESP.getFreeHeap());
    FSInfo fsi{};
    LittleFS.info(fsi);
    s += ",\"fsUsedBytes\":" + String(fsi.usedBytes);
    s += ",\"fsTotalBytes\":" + String(fsi.totalBytes);
    s += ",\"pulses\":" + String(pulseCount);
    s += ",\"captureDone\":" + jsonBool(captureDone);
    s += ",\"captureTruncated\":" + jsonBool(captureTruncated);
    s += ",\"maxPulses\":" + String(MAX_PULSES);
    s += ",\"captureDurationUs\":" + String(captureDurationUs);
    s += ",\"sweepDone\":" + jsonBool(sweepDone);
    s += ",\"sweepCount\":" + String(sweepCount);
    s += ",\"busy\":" + jsonBool(isBusy());
    s += "}";
    sendJson(s);
  });

  server.on("/api/selftest", HTTP_GET, []() {
    const bool spiOk = radio.getCC1101();
    const uint8_t pn = radio.SpiReadStatus(CC1101_PARTNUM);
    const uint8_t ver = radio.SpiReadStatus(CC1101_VERSION);
    FSInfo fsi{};
    const bool fsOk = LittleFS.info(fsi);
    const uint32_t heap = ESP.getFreeHeap();

    const bool versionSane = (ver != 0x00 && ver != 0xFF);
    const bool heapOk = heap > 8000UL;
    const bool wifiOk = (WiFi.status() == WL_CONNECTED) || apActive;
    const bool allOk = spiOk && versionSane && fsOk && heapOk && wifiOk;

    String s = "{\"ok\":" + jsonBool(allOk);
    s += ",\"firmwareVersion\":\"" + String(FIRMWARE_VERSION) + "\"";
    s += ",\"firmwareBuild\":\"" + jsonEscape(String(FIRMWARE_BUILD)) + "\"";
    s += ",\"checks\":{";
    s += "\"spi\":" + jsonBool(spiOk);
    s += ",\"radioVersionSane\":" + jsonBool(versionSane);
    s += ",\"littlefs\":" + jsonBool(fsOk);
    s += ",\"heap\":" + jsonBool(heapOk);
    s += ",\"network\":" + jsonBool(wifiOk);
    s += "}";
    s += ",\"radioPartnum\":" + String(pn);
    s += ",\"radioVersion\":" + String(ver);
    s += ",\"heap\":" + String(heap);
    s += ",\"fsUsedBytes\":" + String(fsi.usedBytes);
    s += ",\"fsTotalBytes\":" + String(fsi.totalBytes);
    s += ",\"mode\":\"" + currentMode + "\"";
    s += ",\"busy\":" + jsonBool(isBusy());
    s += "}";
    sendJson(s);
  });

  server.on("/api/config", HTTP_GET, []() {
    if(server.hasArg("dataRate")) {
      float v = server.arg("dataRate").toFloat();
      if(v < 0.02f) v = 0.02f;
      if(v > 1621.83f) v = 1621.83f;
      radioDataRateKBaud = v;
    }
    if(server.hasArg("txPower")) {
      int v = server.arg("txPower").toInt();
      switch(v) {
        case -30: case -20: case -15: case -10: case -6: case 0:
        case 5: case 7: case 10: case 11: case 12: txPowerDbm = v; break;
        default: txPowerDbm = 10; break;
      }
    }
    if(server.hasArg("minPulse")) minPulseUs = constrain((uint32_t)server.arg("minPulse").toInt(), 5UL, 2000UL);
    if(server.hasArg("megaPulse")) megaPulseUs = constrain((uint32_t)server.arg("megaPulse").toInt(), 100UL, 3000UL);
    if(server.hasArg("megaPulseTol")) megaPulseTolUs = constrain((uint32_t)server.arg("megaPulseTol").toInt(), 25UL, 1500UL);
    if(server.hasArg("megaSymbol")) megaSymbolUs = constrain((uint32_t)server.arg("megaSymbol").toInt(), 1000UL, 20000UL);
    if(server.hasArg("megaSymbolTol")) megaSymbolTolUs = constrain((uint32_t)server.arg("megaSymbolTol").toInt(), 100UL, 5000UL);
    if(server.hasArg("megaFrameGap")) megaFrameGapUs = constrain((uint32_t)server.arg("megaFrameGap").toInt(), 2000UL, 50000UL);
    if(server.hasArg("megaHeaderLow")) megaHeaderLowUs = constrain((uint32_t)server.arg("megaHeaderLow").toInt(), 2000UL, 50000UL);
    if(server.hasArg("megaHeaderTol")) megaHeaderTolUs = constrain((uint32_t)server.arg("megaHeaderTol").toInt(), 100UL, 10000UL);
    if(megaSymbolUs <= megaPulseUs + 500UL) megaSymbolUs = min(20000UL, megaPulseUs + 500UL);
    String s = "{\"ok\":true";
    s += ",\"dataRate\":" + String(radioDataRateKBaud, 2);
    s += ",\"txPower\":" + String(txPowerDbm);
    s += ",\"minPulse\":" + String(minPulseUs);
    s += ",\"megaPulse\":" + String(megaPulseUs);
    s += ",\"megaPulseTol\":" + String(megaPulseTolUs);
    s += ",\"megaSymbol\":" + String(megaSymbolUs);
    s += ",\"megaSymbolTol\":" + String(megaSymbolTolUs);
    s += ",\"megaFrameGap\":" + String(megaFrameGapUs);
    s += ",\"megaHeaderLow\":" + String(megaHeaderLowUs);
    s += ",\"megaHeaderTol\":" + String(megaHeaderTolUs);
    s += "}";
    sendJson(s);
  });

  server.on("/api/tune", HTTP_GET, []() {
    if(isBusy()) return sendError("busy", 409);
    uint32_t hz = (uint32_t)server.arg("hz").toInt();
    uint16_t bw = (uint16_t)server.arg("bw").toInt();
    if(!valid315BandFrequency(hz)) return sendError("frequency must be 300-348 MHz");
    if(bw != 58 && bw != 270 && bw != 650) bw = DEFAULT_CAPTURE_BW_KHZ;

    targetFrequencyHz = hz;
    targetBandwidthKhz = bw;
    restoreTargetRx();
    sendJson("{\"ok\":true,\"frequencyHz\":" + String(targetFrequencyHz) + "}");
  });

