WingTangWong/Wireless_esp8266_cc110_tool/src/main.cpp
  server.on("/api/nudge", HTTP_GET, []() {
    if(isBusy()) return sendError("busy", 409);
    int32_t delta = server.arg("delta").toInt();
    int64_t candidate = (int64_t)targetFrequencyHz + delta;
    if(candidate < 0 || !valid315BandFrequency((uint32_t)candidate)) return sendError("result outside 300-348 MHz");
    targetFrequencyHz = (uint32_t)candidate;
    restoreTargetRx();
    sendJson("{\"ok\":true,\"frequencyHz\":" + String(targetFrequencyHz) + "}");
  });

  server.on("/api/sweep/start", HTTP_GET, []() {
    if(isBusy()) return sendError("busy", 409);

    uint32_t a = (uint32_t)server.arg("start").toInt();
    uint32_t b = (uint32_t)server.arg("stop").toInt();
    uint32_t step = (uint32_t)server.arg("step").toInt();
    int dwell = server.arg("dwell").toInt();
    int bw = server.arg("bw").toInt();

    if(!valid315BandFrequency(a) || !valid315BandFrequency(b) || b <= a || step < 5000) {
      return sendError("bad sweep parameters");
    }

    uint32_t points = ((b - a) / step) + 1;
    if(points > MAX_SWEEP_POINTS) return sendError("too many sweep points; increase step size");
    if(bw != 58 && bw != 270 && bw != 650) bw = 650;
    dwell = constrain(dwell, 2, 25);

    startSweep(a, b, step, (uint16_t)dwell, (uint16_t)bw);
    sendJson("{\"ok\":true}");
  });

  server.on("/api/sweep/data", HTTP_GET, []() {
    String s = "{\"ok\":true,\"count\":" + String(sweepCount) + ",\"points\":[";
    int32_t rssiMin = 127;
    int32_t rssiMax = -128;
    int32_t rssiSum = 0;
    uint32_t peakHz = 0;
    for(uint16_t i = 0; i < sweepCount; ++i) {
      if(i) s += ',';
      s += "{\"hz\":" + String(sweepHz[i]) + ",\"rssi\":" + String(sweepRssi[i]) + "}";
      const int32_t r = sweepRssi[i];
      if(r < rssiMin) rssiMin = r;
      if(r > rssiMax) { rssiMax = r; peakHz = sweepHz[i]; }
      rssiSum += r;
    }
    s += "],\"summary\":";
    if(sweepCount) {
      s += "{\"rssiMinDbm\":" + String(rssiMin);
      s += ",\"rssiMaxDbm\":" + String(rssiMax);
      s += ",\"rssiMeanDbm\":" + String((float)rssiSum / (float)sweepCount, 1);
      s += ",\"peakHz\":" + String(peakHz) + "}";
    } else {
      s += "null";
    }
    s += "}";
    sendJson(s);
  });

  server.on("/api/capture/start", HTTP_GET, []() {
    if(isBusy()) return sendError("busy", 409);
    uint32_t ms = (uint32_t)server.arg("ms").toInt();
    ms = constrain(ms, (uint32_t)50, MAX_CAPTURE_MS);
    startCapture(ms);
    sendJson("{\"ok\":true}");
  });

  server.on("/api/capture/stop", HTTP_GET, []() {
    if(currentMode != "recording") return sendError("not recording", 409);
    stopCapture();
    sendJson("{\"ok\":true,\"pulses\":" + String(pulseCount) + "}");
  });

  server.on("/api/capture/histogram", HTTP_GET, []() {
    if(captureActive) return sendError("capture in progress", 409);
    sendJson(pulseHistogramJson());
  });

  // Raw pulse list of the in-memory capture, for off-device analysis and for
  // cross-checking /api/decode/current. [ [durationUs, level], ... ].
  // Streamed in chunks so a full 3072-pulse buffer cannot exhaust the heap.
  server.on("/api/capture/pulses", HTTP_GET, []() {
    if(captureActive) return sendError("capture in progress", 409);
    server.setContentLength(CONTENT_LENGTH_UNKNOWN);
    server.send(200, "application/json", "");
    String s = "{\"ok\":true,\"frequencyHz\":" + String(targetFrequencyHz);
    s += ",\"durationUs\":" + String(captureDurationUs);
    s += ",\"truncated\":" + jsonBool(captureTruncated);
    s += ",\"count\":" + String(pulseCount) + ",\"pulses\":[";
    for(uint16_t i = 0; i < pulseCount; ++i) {
      if(i) s += ',';
      s += '[' + String(pulseDurations[i]) + ',' + String(pulseLevels[i]) + ']';
      if(s.length() > 1024) { server.sendContent(s); s = ""; }
    }
    s += "]}";
    server.sendContent(s);
    server.sendContent("");
  });

  server.on("/api/decode/current", HTTP_GET, []() {
    if(isBusy()) return sendError("busy", 409);
    sendJson(decodeCurrentJson());
  });

  server.on("/api/sample/save", HTTP_GET, []() {
    if(isBusy()) return sendError("busy", 409);
    String name = safeName(server.arg("name"));
    if(!saveCurrentSample(name)) return sendError("nothing to save or LittleFS error");
    sendJson("{\"ok\":true,\"name\":\"" + name + "\",\"frequencyHz\":" + String(targetFrequencyHz) + "}");
  });

  server.on("/api/sample/load", HTTP_GET, []() {
    if(isBusy()) return sendError("busy", 409);
    String name = safeName(server.arg("name"));
    if(!loadSample(name)) return sendError("sample not found");
    restoreTargetRx();
    sendJson("{\"ok\":true,\"name\":\"" + name + "\",\"frequencyHz\":" + String(targetFrequencyHz) + "}");
  });

  server.on("/api/sample/decode", HTTP_GET, []() {
    if(isBusy()) return sendError("busy", 409);
    String name = safeName(server.arg("name"));
    if(!loadSample(name)) return sendError("sample not found");
    sendJson(decodeCurrentJson());
  });

  server.on("/api/sample/play", HTTP_GET, []() {
    if(isBusy() || playbackRequested) return sendError("busy", 409);
    String name = safeName(server.arg("name"));
    if(!loadSample(name)) return sendError("sample not found");

    int repeat = server.arg("repeat").toInt();
    playbackRepeats = (uint8_t)constrain(repeat, 1, 10);
    playbackInvertRequested = server.arg("invert").toInt() != 0;
    playbackRequested = true;
    sendJson("{\"ok\":true}");
  });

  server.on("/api/sample/delete", HTTP_GET, []() {
    if(isBusy()) return sendError("busy", 409);
    String name = safeName(server.arg("name"));
    bool ok = LittleFS.remove(samplePath(name));
    sendJson(String("{\"ok\":") + jsonBool(ok) + "}");
  });

  server.on("/api/samples", HTTP_GET, []() {
    // Chunk-streamed: one saved sample's JSON at a time, so a full LittleFS
    // never has to fit in a single String.
    server.setContentLength(CONTENT_LENGTH_UNKNOWN);
    server.send(200, "application/json", "");
    server.sendContent("{\"ok\":true,\"samples\":[");

    bool first = true;
    Dir dir = LittleFS.openDir("/");

    while(dir.next()) {
      String base = dir.fileName();
      if(base.startsWith("/")) base = base.substring(1, base.length());
      if(!base.startsWith("rf315_") || !base.endsWith(".bin")) continue;

      File f = dir.openFile("r");
      SampleHeader h{};
      bool good = f &&
                  f.read(reinterpret_cast<uint8_t*>(&h), sizeof(h)) == sizeof(h) &&
                  memcmp(h.magic, "315R", 4) == 0 && h.version == 1;
      f.close();
      if(!good) continue;

      int start = String("rf315_").length();
      String name = base.substring(start, base.length() - 4);
      String row = first ? "" : ",";
      first = false;
      row += "{\"name\":\"" + name + "\"";
      row += ",\"frequencyHz\":" + String(h.frequencyHz);
      row += ",\"pulseCount\":" + String(h.pulseCount);
      row += ",\"durationUs\":" + String(h.durationUs);
      row += "}";
      server.sendContent(row);
    }

